---
kind: property
id: P:Autodesk.Revit.DB.Analysis.HVACLoadBuildingType.UnoccupiedCoolingSetPoint
source: html/ca69d367-dcb1-7318-ee7e-012a5bfbb9f2.htm
---
# Autodesk.Revit.DB.Analysis.HVACLoadBuildingType.UnoccupiedCoolingSetPoint Property

The unoccupied cooling set point of the building type with unit kelvin (K).

## Syntax (C#)
```csharp
public double UnoccupiedCoolingSetPoint { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: The value should be between (273.15, 373.15] with unit kelvin (K).